### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('ratings.csv')
rating = data[['movieId', 'rating']]
rating = rating.loc[rating['rating'] == 5.0]
rating.groupby('movieId').count().sort_values('rating', ascending=False).head()

         rating
movieId
318         153
296         123
356         116
2571        109
260         104

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [107]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [108]:
baltic = data[(data['country'].isin(['Lithuania', 'Latvia', 'Estonia']))]

In [109]:
baltic = baltic[(baltic['category'].isin([4,12,21]))]

In [110]:
baltic = baltic[(baltic['year'].isin([2005,2006,2007,2008,2009,2010]))]

In [111]:
baltic.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [113]:
baltic.loc[baltic['quantity'] < 0, 'quantity'] = 0

In [114]:
baltic['total'] = baltic['quantity'].sum(axis=0)
baltic.head()

         country  year  quantity  category     total
10617    Estonia  2008       1.0         4  240580.0
10618    Estonia  2007       0.0         4  240580.0
10619    Estonia  2006       0.0         4  240580.0
10620    Estonia  2005       1.0         4  240580.0
11156  Lithuania  2008       1.0         4  240580.0

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [115]:
# Таблица с сайта https://terrikon.com/football/spain/championship/. Турнирная таблица Ла Лиги

In [116]:
df = pd.read_html('https://terrikon.com/football/spain/championship/', attrs = {'class':'grouptable'}, encoding='UTF=8')

In [123]:
df

[    Unnamed: 0     Unnamed: 1   И   В   Н   П   З  -  П.1   О
 0          1.0           Реал  32  21   8   3  60  -   21  71
 1          2.0      Барселона  32  21   6   5  72  -   33  69
 2          3.0     Атлетико М  32  15  13   4  41  -   23  58
 3          4.0        Севилья  32  14  12   6  45  -   33  54
 4          5.0     Вильярреал  32  15   6  11  51  -   40  51
 5          6.0         Хетафе  31  13  10   8  40  -   29  49
 6          7.0  Реал Сосьедад  31  14   5  12  47  -   39  47
 7          8.0       Валенсия  32  12  10  10  41  -   46  46
 8          9.0      Атлетик Б  32  11  12   9  36  -   28  45
 9         10.0        Гранада  32  12   7  13  38  -   38  43
 10        11.0        Осасуна  32  10  11  11  38  -   47  41
 11        12.0        Леванте  32  12   5  15  41  -   46  41
 12        13.0          Бетис  32   9  10  13  43  -   52  37
 13        14.0         Алавес  32   9   8  15  32  -   48  35
 14        15.0     Вальядолид  32   7  14  11  27  -   37  35
 15        16.0          Эйбар  32   9   8  15  34  -   48  35
 16        17.0         Сельта  32   7  13  12  31  -   37  34
 17        18.0       Мальорка  32   7   5  20  30  -   55  26
 18        19.0        Леганес  32   5  10  17  24  -   46  25
 19        20.0       Эспаньол  32   5   9  18  26  -   51  24]